# 第２章

## 10. 行数のカウント
行数をカウントせよ．確認にはwcコマンドを用いよ．

In [1]:
!wget https://nlp100.github.io/data/popular-names.txt

--2022-04-17 00:41:56--  https://nlp100.github.io/data/popular-names.txt
Resolving nlp100.github.io (nlp100.github.io)... 185.199.110.153, 185.199.109.153, 185.199.108.153, ...
Connecting to nlp100.github.io (nlp100.github.io)|185.199.110.153|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 55026 (54K) [text/plain]
Saving to: ‘popular-names.txt.1’

popular-names.txt.1 100%[===================>]  53.74K  --.-KB/s    in 0.06s

2022-04-17 00:41:56 (887 KB/s) - ‘popular-names.txt.1’ saved [55026/55026]

In [2]:
with open('popular-names.txt', 'r') as f:
    data = f.read()
data.count('\n')

2780

In [3]:
!wc -l popular-names.txt

2780 popular-names.txt

## 11. タブをスペースに置換
タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ

In [4]:
import pandas as pd
data = pd.DataFrame([d.split('\t') for d in data.split('\n')], columns=['name', 'gender', 'num1', 'num2'])
data.head()

        name gender  num1  num2
0       Mary      F  7065  1880
1       Anna      F  2604  1880
2       Emma      F  2003  1880
3  Elizabeth      F  1939  1880
4     Minnie      F  1746  1880

In [5]:
!sed -e 's/\t/ /g' popular-names.txt | head -n 5

Mary F 7065 1880
Anna F 2604 1880
Emma F 2003 1880
Elizabeth F 1939 1880
Minnie F 1746 1880

## 12. 1列目をcol1.txtに，2列目をcol2.txtに保存
各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [6]:
data['name'].to_csv('./col1.txt', header=False, index=False)
data['gender'].to_csv('./col2.txt', header=False, index=False)

In [7]:
!cut -f 1 popular-names.txt >> col1.txt
!cut -f 2 popular-names.txt >> col2.txt
!cat col1.txt | head -n 5
!cat col2.txt | head -n 5

Mary
Anna
Emma
Elizabeth
Minnie
F
F
F
F
F

## 13. col1.txtとcol2.txtをマージ
12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ

In [8]:
col1 = pd.read_csv('col1.txt', sep='\t', header=None)
col2 = pd.read_csv('col2.txt', sep='\t', header=None)
pd.concat([col1, col2], axis=1).head()

           0  0
0       Mary  F
1       Anna  F
2       Emma  F
3  Elizabeth  F
4     Minnie  F

In [9]:
!paste col1.txt col2.txt | head -n 5

Mary	F
Anna	F
Emma	F
Elizabeth	F
Minnie	F

## 14. 先頭からN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [10]:
def print_N(n):
    print(pd.read_csv('popular-names.txt', sep='\t',header=None).head(n))
print_N(5)

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880

In [11]:
!head -n 5 popular-names.txt

Mary	F	7065	1880
Anna	F	2604	1880
Emma	F	2003	1880
Elizabeth	F	1939	1880
Minnie	F	1746	1880

## 15. 末尾のN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [12]:
def print_N(n):
    print(pd.read_csv('popular-names.txt', sep='\t',header=None).tail(n))
print_N(5)

             0  1      2     3
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

In [13]:
!tail -n 5 popular-names.txt

Benjamin	M	13381	2018
Elijah	M	12886	2018
Lucas	M	12585	2018
Mason	M	12435	2018
Logan	M	12352	2018

## 16. ファイルをN分割する
自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [14]:
def split_N(n):
    df = pd.read_csv('popular-names.txt', sep='\t',header=None)
    l = len(df)//n # 1ファイル当たりの行数
    dfs = [df.loc[i:i+l-1, :] for i in range(0, len(df), l)]
    for df in dfs:
        print(df.head())
split_N(5)

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880
          0  1      2     3
556  Joseph  M   3844  1907
557   Frank  M   2943  1907
558  Edward  M   2576  1907
559   Henry  M   2203  1907
560    Mary  F  18665  1908
            0  1      2     3
1112     John  M  47499  1935
1113  William  M  40198  1935
1114  Richard  M  33945  1935
1115  Charles  M  29983  1935
1116   Donald  M  29661  1935
            0  1      2     3
1668   Sandra  F  21619  1963
1669  Cynthia  F  21593  1963
1670  Michael  M  83782  1963
1671     John  M  78625  1963
1672    David  M  78467  1963
              0  1      2     3
2224   Samantha  F  25645  1991
2225      Sarah  F  25225  1991
2226  Stephanie  F  22774  1991
2227   Jennifer  F  20673  1991
2228  Elizabeth  F  20392  1991

In [15]:
# 上記同様に5つのファイルに分割                    ↓
!split -l $((`cat popular-names.txt | wc -l`/5)) -d popular-names.txt split
!find ./ -name 'split*'

./split00
./split01
./split02
./split03
./split04

## 17. １列目の文字列の異なり
1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [16]:
import numpy as np
len(data['name'].replace('', np.nan).dropna().unique())

136

In [17]:
!cut -f 1 popular-names.txt | sort | uniq | wc -l

136

## 18. 各行を3コラム目の数値の降順にソート
各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [18]:
data.sort_values(by='num1', ascending=False).head()

         name gender   num1  num2
1340    Linda      F  99689  1947
632     James      M   9951  1911
665   Mildred      F   9921  1913
120      Mary      F   9889  1886
140      Mary      F   9888  1887

In [19]:
!cat popular-names.txt | sort -rnk 3 | head -n 5

Linda	F	99689	1947
Linda	F	96211	1948
James	M	94757	1947
Michael	M	92704	1957
Robert	M	91640	1947

## 19. 各行の1コラム目の文字列の出現頻度を求め，出現頻度の高い順に並べる
各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [20]:
# data['name'].value_counts()
data[['name', 'num1']].groupby('name').count().sort_values(by='num1',ascending=False).head()

         num1
name
James     118
William   111
Robert    108
John      108
Mary       92

In [21]:
!cut -f 1 popular-names.txt | sort | uniq -c | sort -rk 1 | head -n 5

    118 James
    111 William
    108 Robert
    108 John
     92 Mary